tutorials/fluidSolidInteraction/cht/robinCavity/0/fluid/p
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | foam-extend: Open Source CFD                    |
|  \\    /   O peration     | Version:     4.0                                |
|   \\  /    A nd           | Web:         http://www.foam-extend.org         |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    object      p;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 2 -2 0 0 0 0];

internalField   uniform 0;

boundaryField
{
    bottom
    {
        type          zeroGradient;
        value         uniform 0;

        // type newElasticWallPressure;
	// virtualWallThickness uniform 0.001;
        // value uniform 0;
    }

    left
    {
        type           zeroGradient;
        value          uniform 0;
    }

    right
    {
	type           zeroGradient;
	value          uniform 0;
    }

    top
    {
	type           zeroGradient;
	value          uniform 0;
    }

    frontAndBack
    {
        type            empty;
    }
}


// ************************************************************************* //
