tutorials/fluidSolidInteraction/cht/robinCavity/0/solid/D
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | foam-extend: Open Source CFD                    |
|  \\    /   O peration     | Version:     3.0                                |
|   \\  /    A nd           | Web:         http://www.extend-project.de       |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volVectorField;
    object      D;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 1 0 0 0 0 0];

internalField   uniform (0 0 0);

boundaryField
{
    top
    {
        type            fixedDisplacement;
        value           uniform (0 0 0);
        // type            tractionExtrapolatedDisplacement;
        // traction        uniform ( 0 0 0 );
        // pressure        uniform 0.001;
        // value           uniform (0 0 0);
    }

    left
    {
        type            fixedDisplacement;
        value           uniform (0 0 0);
    }

    right
    {
        type            fixedDisplacement;
        value           uniform (0 0 0);
    }

    bottom
    {
        type            fixedDisplacement;
        value           uniform (0 0 0);
        // type            tractionExtrapolatedDisplacement;
        // traction        uniform ( 0 0 0 );
        // pressure        uniform 0;
        // value           uniform (0 0 0);
    }

    frontAndBack
    {
        type            empty;
    }
}


// ************************************************************************* //
